{
  "name": "Welcome!",
  "pages": [
    {
      "sort": 0,
      "name": "Welcome!",
      "type": "text",
      "_id": "xakJzhfviTiovJqd",
      "title": {
        "show": false,
        "level": 1
      },
      "image": {},
      "text": {
        "format": 1,
        "content": "<h2>What is the Hero Point Deck?</h2><p>It is a <a href=\"https://paizo.com/products/btq024ut\">deck of cards sold by Paizo</a> to use in conjunction with Hero Points. Each card has a trigger and an effect that you must spend a Hero Point to use, and when you do, you discard both the card and the Hero Point. In that sense, you can think of the card as representing your Hero Point. You can still spend Hero Points for their normal reroll and death-prevention uses. You can see the full rules @UUID[Compendium.pf2e.journals.JournalEntry.BSp4LUSaOmUyjBko.JournalEntryPage.f7UznjPq2aRARwkr]{here}.</p><h2>What does this expansion contain?</h2><ul><li>A journal with a growing library of homebrew cards, written in a similar style to the original Hero Point Deck.</li><li>A journal with \"patches\" for existing cards where I have felt their power level is lacking for the cost of a Hero Point. They can be found here.</li><li>A compendium of Foundry effects automating the cards' effects whenever possible.</li><li>Rollable tables to draw a random card, whether you want to use this module's cards exclusively, or add them to the original Hero Point Deck, as well as a rollable table with the module's patches for original cards.</li></ul><h2>How to use this module?</h2><p>Head to the compendium folder named \"Hero Point Deck Expansion\", which contains three compendia. If you want to browse the cards, go to the journals compendium to see the expansion and patched cards. Once you're ready to start drawing random cards, go to the module's tables compendium and drag the table you want to your macro bar!</p><p>While rollable tables are sufficient to draw random cards, I highly recommend you make use of the <a href=\"https://foundryvtt.com/packages/pf2e-toolbelt\">PF2e Toolbelt</a> module's <a href=\"https://github.com/reonZ/pf2e-toolbelt/wiki/Hero-Actions\">Hero Actions</a> feature. The module will allow your players to use, discard, and even trade cards amongst each other, all from their own character sheets! All you need to do is go to PF2e Toolbelt's settings and link the appropriate table to draw cards from.</p><img src=\"modules/pf2e-hero-point-deck-expansion/assets/toolbelt-setting.webp\" /><h2>A word on Kineticist</h2><p>Kineticist is mechanically unique, and many cards do not take these mechanics into account. Here are some quick and dirty rules to allow kineticists to use these cards.</p><p>For the purposes of using or triggering Hero Point Card</p><ul><li><p>A kineticist can treat an Elemental Blast as a Strike. If needed, they count as an unarmed attack in the brawling group.</p></li><li><p>A 2-action impulse (including Elemental Blast) can be treated as a cantrip.</p></li></ul><p>As a GM, you should feel free to improvise and allow a card to work with kineticist if you think it should.</p>"
      },
      "video": {
        "controls": true,
        "volume": 0.5
      },
      "src": null,
      "system": {},
      "ownership": {
        "default": -1,
        "8uBJxjNukwwp5BWW": 3
      },
      "flags": {
        "core": {}
      },
      "_stats": {
        "compendiumSource": "JournalEntry.TIUSxRW19ByyoZ2E.JournalEntryPage.xakJzhfviTiovJqd",
        "duplicateSource": null,
        "coreVersion": "13.346",
        "systemId": "pf2e",
        "systemVersion": "6.7.1",
        "exportSource": null
      },
      "category": null,
      "_key": "!journal.pages!OYGoRDmDVpnhhMC8.xakJzhfviTiovJqd"
    }
  ],
  "folder": null,
  "ownership": {
    "default": 0,
    "8uBJxjNukwwp5BWW": 3
  },
  "flags": {},
  "_stats": {
    "compendiumSource": null,
    "duplicateSource": null,
    "coreVersion": "13.346",
    "systemId": "pf2e",
    "systemVersion": "6.7.1",
    "exportSource": null
  },
  "_id": "OYGoRDmDVpnhhMC8",
  "sort": 100000,
  "categories": [],
  "_key": "!journal!OYGoRDmDVpnhhMC8"
}
